In [1]:
from __future__ import print_function
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
columns = ['name', 'age', 'gender', 'job']
user1 = pd.DataFrame([['alice', 19, "F", "student"],
                      ['john', 26, "M", "student"]],
        columns=columns)
user2 = pd.DataFrame([['eric', 22, "M", "student"],
                      ['paul', 58, "F", "manager"]],
        columns=columns)
user3 = pd.DataFrame(dict(name=['peter', 'julie'],
                          age=[33, 44], gender=['M', 'F'],
                          job=['engineer', 'scientist']))

In [3]:
user4 = pd.DataFrame(dict(name=['alice', 'john', 'eric', 'julie'],
                          height=[165, 180, 175, 171]))
print(user4)

   height   name
0     165  alice
1     180   john
2     175   eric
3     171  julie

In [5]:
user1.append(user2)
users = pd.concat([user1, user2, user3])

In [6]:
users = pd.merge(users, user4, on="name", how='outer')
print(users)

   age gender        job   name  height
0   19      F    student  alice   165.0
1   26      M    student   john   180.0
2   22      M    student   eric   175.0
3   58      F    manager   paul     NaN
4   33      M   engineer  peter     NaN
5   44      F  scientist  julie   171.0

In [7]:
merge_inter = pd.merge(users, user4, on="name")
print(merge_inter)

   age gender        job   name  height_x  height_y
0   19      F    student  alice     165.0       165
1   26      M    student   john     180.0       180
2   22      M    student   eric     175.0       175
3   44      F  scientist  julie     171.0       171

In [9]:
users
type(users) 
users.head() 
users.tail() 
users.describe()

             age      height
count   6.000000    4.000000
mean   33.666667  172.750000
std    14.895189    6.344289
min    19.000000  165.000000
25%    23.000000  169.500000
50%    29.500000  173.000000
75%    41.250000  176.250000
max    58.000000  180.000000

In [10]:
users.index
users.columns
users.dtypes
users.shape
users.values
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
age       6 non-null int64
gender    6 non-null object
job       6 non-null object
name      6 non-null object
height    4 non-null float64
dtypes: float64(1), int64(1), object(3)
memory usage: 288.0+ bytes

In [11]:
users.describe(include='all')

              age gender      job  name      height
count    6.000000      6        6     6    4.000000
unique        NaN      2        4     6         NaN
top           NaN      M  student  paul         NaN
freq          NaN      3        3     1         NaN
mean    33.666667    NaN      NaN   NaN  172.750000
std     14.895189    NaN      NaN   NaN    6.344289
min     19.000000    NaN      NaN   NaN  165.000000
25%     23.000000    NaN      NaN   NaN  169.500000
50%     29.500000    NaN      NaN   NaN  173.000000
75%     41.250000    NaN      NaN   NaN  176.250000
max     58.000000    NaN      NaN   NaN  180.000000

In [12]:
users.describe(include=['object']) # limit to one (or more) types

       gender      job  name
count       6        6     6
unique      2        4     6
top         M  student  paul
freq        3        3     1

In [ ]:
# Column selection

In [20]:
users['gender']
type(users['gender'])
users.gender
c= ['gender', 'age']
print (users[c])
print (type(users[c]))

  gender  age
0      F   19
1      M   26
2      M   22
3      F   58
4      M   33
5      F   44
<class 'pandas.core.frame.DataFrame'>

Object `pd` not found.